[
  {
    "id": 1,
    "name": "tetris",
    "img": "https://user-images.githubusercontent.com/112145050/255481076-da8287a2-4abe-4cbd-9c3a-28c7a3c27493.png",
    "deskripsi": "Tetris adalah permainan video klasik dan ikonik yang menantang, menghibur, dan mengasah kemampuan pemain dalam strategi dan refleks. Dalam permainan ini, pemain harus mengatur dan menyusun berbagai bentuk geometris yang disebut tetrominoes, yang terdiri dari empat kotak yang berbeda, saat jatuh dari atas layar. Tujuan utama pemain adalah untuk membentuk baris horizontal penuh dengan tetrominoes, sehingga baris tersebut akan hilang dan memberi ruang kosong untuk mengisi lebih banyak tetrominoes.",
    "cerita": "Tetris pertama kali dibuat oleh seorang programmer asal Rusia bernama Alexey Pajitnov. Pada tahun 1984, saat bekerja di Akademi Ilmu Pengetahuan di Moskow, Pajitnov menciptakan permainan ini sebagai bagian dari proyek penelitiannya di bidang kecerdasan buatan. Dia menggunakan komputer elektronika 60-an, Electronika 60, untuk mengembangkan permainan tersebut.<br/> Nama 'Tetris' berasal dari kata 'tetra' yang berarti 'empat' dalam bahasa Yunani. Nama ini mencerminkan fakta bahwa semua bentuk atau blok dalam permainan terdiri dari empat kotak (tetrominoes). <br/> Pada tahun 1986, Tetris dirilis secara resmi oleh perusahaan perangkat lunak Soviet, Elektronorgtechnica (ELORG). Game ini menjadi sangat populer di kalangan pemain komputer Soviet. Namun, popularitasnya tidak berhenti di wilayah Soviet saja.",
    "link_play": "https://asep38.github.io/game-tetris.github.io/"
  },
  {
    "id": 2,
    "name": "snake",
    "img": "https://user-images.githubusercontent.com/112145050/255480482-4206a778-9452-41cf-8663-eebdabaf15fe.png",
    "deskripsi": "Game Snake adalah permainan video klasik yang sederhana namun adiktif, di mana pemain mengendalikan seekor ular untuk mengumpulkan makanan (apel) yang tersebar di area permainan. Setiap kali ular memakan apel, panjangnya akan bertambah. Tujuan utama pemain adalah bertahan selama mungkin dan mencetak skor tertinggi dengan mengendalikan gerakan ular secara bijaksana.",
    "cerita": "Cerita dimulai pada tahun 1976, ketika seorang insinyur komputer bernama Gremlin Industries menciptakan permainan sederhana berjudul 'Blockade.' Permainan ini merupakan permainan multi-pemain yang mengharuskan pemain mengendalikan garis bergerak di layar untuk menghindari tabrakan dengan dinding atau garis lawan. Blockade menjadi hit di arcade dan menjadi salah satu permainan video pertama yang menampilkan aspek permainan yang mirip dengan game Snake.<br/> Pada tahun 1977, Atari merilis permainan bernama 'Surround,' yang merupakan adaptasi dari Blockade. Surround memperkenalkan mode single-player, di mana pemain harus mengendalikan garis yang terus bertambah panjang saat mereka bergerak di layar. Jika garis tersebut menabrak dinding atau dirinya sendiri, permainan berakhir. Meskipun masih sederhana, permainan ini menarik perhatian banyak orang dan menjadi populer di arcade. <br/> Namun, kesuksesan dan popularitas sesungguhnya dari game Snake bermula pada tahun 1997 ketika Nokia, salah satu perusahaan telekomunikasi terkemuka, merilis ponsel bermodel Nokia 6110. Ponsel ini dilengkapi dengan permainan sederhana yang disebut 'Snake.' Permainan ini menjadi bagian dari paket permainan standar pada banyak ponsel Nokia yang dirilis selama tahun-tahun berikutnya. ",
    "link_play": "https://asep38.github.io/game-snake.github.io/"
  },
  {
    "id": 3,
    "name": "memory",
    "img": "https://user-images.githubusercontent.com/112145050/255480055-9a1692ba-3493-4206-b82d-df44b1218091.png",
    "deskripsi": "Game memori adalah permainan teka-teki yang menantang pemain untuk mengingat posisi dan gambar dari kartu-kartu yang tersebar di atas meja. Tujuan utama dari permainan ini adalah mencocokkan dua kartu yang sama dengan membaliknya secara berurutan dalam jumlah giliran yang terbatas. Pemain harus mengasah daya ingat dan konsentrasi mereka untuk menemukan dan mengingat lokasi kartu-kartu tersebut, karena setiap kartu hanya bisa terlihat sementara sebelum dibalik kembali. Dengan level kesulitan yang semakin meningkat, game memori menjadi cara yang menyenangkan untuk melatih kemampuan kognitif dan menguji kemampuan pemain dalam mengingat informasi dengan cepat dan akurat.",
    "cerita": "Cerita game Memory bermula pada awal tahun 1950-an ketika seorang psikolog bernama Hermann Ebbinghaus meneliti tentang proses memori manusia. Ebbinghaus menemukan bahwa manusia cenderung lebih baik mengingat informasi yang muncul secara berulang-ulang atau repetitif. Inspirasi inilah yang mengarahkannya untuk menciptakan eksperimen yang melibatkan kartu-kartu dengan simbol-simbol yang berbeda. Eksperimen ini membuktikan bahwa kemampuan memori manusia dapat ditingkatkan dengan latihan dan pembiasaan tertentu. Namun, baru pada tahun 1959, Ralph Haber, seorang psikolog lainnya, berkolaborasi dengan seorang desainer bernama Harry Hollingworth, menghasilkan versi awal dari apa yang kemudian dikenal sebagai 'The Game of Concentration' atau yang lebih dikenal sebagai 'Game Memory' saat ini. <br/> Pada tahun 1970-an, teknologi komputer semakin berkembang dan memungkinkan game Memory untuk diproduksi dalam bentuk digital. Game ini menjadi populer di antara anak-anak dan keluarga, dan segera menyebar di komputer pribadi dan konsol permainan. Dengan perkembangan teknologi, game Memory pun menjadi lebih beragam dengan gambar-gambar menarik dan variasi tema yang berbeda. Keasikan bermain dan manfaat positif bagi perkembangan memori membuat game Memory terus bertahan sebagai salah satu permainan teka-teki klasik yang dicintai oleh banyak orang dari berbagai usia. <br/> Hingga saat ini, game Memory telah mengalami berbagai adaptasi dan variasi dalam berbagai platform, termasuk perangkat seluler, tablet, dan komputer. Berbagai perusahaan dan pengembang terus menciptakan versi baru dari game ini dengan tambahan fitur-fitur menarik, tantangan lebih beragam, serta visual dan grafis yang menarik. Seiring perkembangan zaman, game Memory tetap relevan dan menjadi permainan yang populer untuk mengasah daya ingat, konsentrasi, dan keterampilan kognitif lainnya, sambil memberikan hiburan yang menyenangkan bagi para pemainnya. ",
    "link_play": "https://asep38.github.io/game-memory.github.io/"
  },
  {
    "id": 4,
    "name": "tic-tac-toe",
    "img": "https://user-images.githubusercontent.com/112145050/255478004-7b74d0c4-6421-4828-b786-88113e6e708c.png",
    "deskripsi": "Tic-tac-toe, juga dikenal sebagai 'Xs and Os' atau 'Noughts and Crosses' di beberapa wilayah, adalah permainan papan klasik yang dimainkan oleh dua pemain dengan tanda yang berbeda, biasanya 'X' dan 'O', pada sebuah papan 3x3. Tujuan permainan ini adalah untuk mencoba menempatkan tiga tanda yang sama secara berurutan baik horizontal, vertikal, atau diagonal di papan permainan. Permainan ini berakhir dengan imbang jika papan penuh tanpa ada tiga tanda yang sama berurutan.",
    "cerita": "Tic-tac-toe merupakan salah satu permainan tertua di dunia, dengan sejarah yang panjang dan beragam. Asal usul pasti permainan ini sulit dilacak, tetapi beberapa teori menyatakan bahwa permainan ini bisa berasal dari Mesir kuno, Romawi, atau Cina kuno. <br/> Ada bukti bahwa versi sederhana dari tic-tac-toe telah dimainkan di Mesir kuno pada sekitar abad ke-1 Masehi. Dinding batu yang ditemukan di kuil Karnak, Luxor, menunjukkan gambar dari apa yang tampak seperti permainan X dan O. <br/> Selain itu, ada juga permainan yang mirip dengan tic-tac-toe yang disebut 'Terni Lapilli' yang dimainkan oleh orang Romawi pada zaman kuno. Permainan ini dimainkan dengan menggambar garis-garis pada tanah untuk membuat papan 3x3 dan pemain harus mencoba menempatkan tiga batu secara berurutan di papan. <br/> Di Cina kuno, ada sebuah permainan bernama 'Gomoku Narabe' yang mirip dengan tic-tac-toe, dimana pemain harus mencoba menempatkan lima batu secara berurutan di papan permainan 15x15. <br/> Seiring berjalannya waktu, permainan ini menyebar ke berbagai budaya dan negara, dan bentuk modern tic-tac-toe yang paling dikenal mulai muncul pada abad ke-19. Permainan ini menjadi sangat populer sebagai permainan sederhana untuk anak-anak di sekolah dan rumah, serta sebagai teka-teki di koran dan majalah.",
    "link_play": "https://asep38.github.io/game-tictactoe.github.io/"
  }
]
